import {
    Box,
    Container,
    Flex,
    Heading,
    Stack,
    Text
} from '@chakra-ui/react';
import React from 'react';
import WithSubnavigation from '../LibarayHeader/LibararyHeader';
import CaptionCarousel from '../LibararyCarasoul/LibararyCarasoul';
import LargeWithNewsletter from '../LibraryFooter/LibarayFooter';

const LibraryStrategicPlan = () => {
    return (
        <>
            <WithSubnavigation />
            <CaptionCarousel />
            <Box p={4}>
                <Stack spacing={4} as={Container} maxW={'3xl'} textAlign={'center'}>
                    <Heading fontSize={{ base: 'xl', sm: '3xl' }} fontWeight={'bold'}>
                        الخطة الاستراتيجية للمكتبة
                    </Heading>

                </Stack>
                <Container maxW={'5xl'} mt={12} textAlign={"right"}>
                    <p>يعد التخطيط الاستراتيجي من العمليات التي لا يمكن الاستغناء عنها في وقتنا الحالي الذي يميزه التأثير القوي والمتزايد للبيئة في المكتبات  في أنحاء العالم . فلقد أصبحت المكتبات اليوم ملزمة بتحسين مستوى أدائها من أجل رفع مستوى مخرجاتها وتقديم خدمات بكفاءة عالية؛ ولا يمكن للمكتبات تحقيق هذه الأهداف إلا بالتحكم في مسيرتها ورسم مستقبلها بالطريقة التي تخدم آمالها وطموحاتها. ويعد التخطيط الاستراتيجي الوسيلة الأنسب التي يمكن الاعتماد عليها من أجل تحديد الوضع المستقبلي المرغوب وحصر وتعبئة الموارد الضرورية للوصول إلى ذلك الوضع</p>
                    <Container maxW={'5xl'} mt={12} textAlign={"right"} mb={5}>
                        <Heading fontSize={{ base: 'xl', sm: '2xl' }} fontWeight={'light'} mb={2} color={"#0D74FF"}>
                            تمهيد
                        </Heading>
                        <p>يعطي التخطيط الاستراتيجي نظرة شاملة عما تقوم به المكتبة وإلى أين تتجه. كما يسلط الضوء على ما تريد أن تقوم به المكتبة  والكيفية التي ستعملها للوصل إلى ما تريد الوصول إليه</p>
                        <p>يساعد التخطيط الاستراتيجي على الإجابة على أكبر وأهم الأسئلة التي تطرحها المنظمات يوميا، كما يساعدها أيضا على التحكم في مسيرتها وممارساتها</p>
                        <p>وتختلف المقاربات الاستراتيجية وبهذا تختلف ممارسات التخطيط الاستراتيجي أيضا، ومهما كانت الممارسة التي نختارها فهناك مجموعة من القيود التي لا يمكن إغفالها أو عدم احترامها لأن كل الممارسات تشير إلى أهمية احترامها</p>
                    </Container>
                    <Container maxW={'5xl'} mt={12} textAlign={"right"} mb={5}>
                        <Heading fontSize={{ base: 'xl', sm: '2xl' }} fontWeight={'light'} mb={2} color={"#0D74FF"}>
                            مراحل التخطيط الاستراتيجي
                        </Heading>
                        <p>تختلف مراحل عملية التخطيط الاستراتيجي باختلاف المقاربات التي يبنى عليه التفكير الاستراتيجي نفسه</p>
                        <p>و تتم عملية التخطيط الاستراتيجي في المراحل التالية :</p>
                        <ul>
                            <li>أولا – تحليل بيئة المكتبة </li>
                            <li>ثانيا – تحديد هوية المكتبة </li>
                            <li>ثالثا -  تحديد الخيارات الاستراتيجية </li>
                            <li>رابعا – تحديد الأهداف الاستراتيجية</li>
                        </ul>
                    </Container>
                    <Container maxW={'5xl'} mt={12} textAlign={"right"} mb={5}>
                        <Heading fontSize={{ base: 'xl', sm: '2xl' }} fontWeight={'light'} mb={2} color={"#0D74FF"}>
                            : القيم التى تسعى لنشرها مكتبة الكلية
                        </Heading>
                        <ul>
                            <li>	الأمانة : العمل  على حماية الملكية الفكرية</li>
                            <li>	المعرفة : بالاسهام للوصول إلى مجتمع المعرفة</li>
                            <li>	الجودة : بتطبيق معايير الجودة في أداء المكتبة والخدمات فيها </li>
                            <li>	الإبداع : من خلال تبنى أفكار وتقنيات حديثة </li>
                            <li>	التعاون : التواصل مع المكتبات ومراكز المعلومات الآخرى </li>
                            <li>	التواصل : من خلال التواصل بين المستفيدين داخل المكتبة ببعضهم البعض وبالمجتمع الخارجى </li>
                            <li>	البناء : يتم من خلال بناء ثقافة بناء شخصية علمية متمكنة للمستفيدين </li>
                        </ul>
                    </Container>
                    <Container maxW={'5xl'} mt={12} textAlign={"right"} mb={5}>
                        <Heading fontSize={{ base: 'xl', sm: '2xl' }} fontWeight={'light'} mb={2} color={"#0D74FF"}>
                            الأهداف الاستراتيجية للمكتبة
                        </Heading>
                        <ul listStyle>
                            <li>	الارتقاء بالخدمات المقدمة للمستفيدين وتقديم خدمات مميزة لمجتمع مكتبة الكلية</li>
                            <li>	الارتقاء بالبحث العلمي و تقديم دعم أفضل للباحثين</li>
                            <li>	تعزيز كفاية وكفاءة العاملين بالمكتبة والنهوض بمستواهم</li>
                            <li>	إرضاء المستفيدين بكل فئاتهم</li>
                            <li>	 تنظيم وتحليل مصادر المعلومات بحيث يتيسر الوصول إلي أي منها أو معلومة فيها بأقل جهد وبأقصر طريق وفي أقصر وقت ممكن</li>
                        </ul>
                    </Container>
                </Container>
            </Box>
            <LargeWithNewsletter />
        </>
    );
}

export default LibraryStrategicPlan;